# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [3]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
serie1 = pd.Series(lst)
serie1.head()

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [4]:
serie1[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [5]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
df1 = pd.DataFrame(b)
df1.head()

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9

### 5. Rename the data frame columns based on the names in the list below.

In [4]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [16]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']
colnames_series = pd.Series(colnames)
display(colnames_series)

0    Score_1
1    Score_2
2    Score_3
3    Score_4
4    Score_5
dtype: object

In [21]:
df1 = df1.rename(columns = colnames_series)
df1.head()

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [28]:
df1_135 = df1[["Score_1", "Score_3", "Score_5"]]
df1_135.head()

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9

### 7. From the original data frame, calculate the average Score_3 value.

In [41]:
df1[["Score_3"]].mean()

Score_3    56.95
dtype: float64

### 8. From the original data frame, calculate the maximum Score_4 value.

In [38]:
df1[["Score_4"]].max()

Score_4    88.8
dtype: float64

### 9. From the original data frame, calculate the median Score 2 value.

In [39]:
df1[["Score_2"]].median()

Score_2    40.75
dtype: float64

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [109]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [60]:
df_products = pd.DataFrame(orders)
df_products.head(10)

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [53]:
df_products[["Quantity", "Revenue"]].sum()

Quantity    2978.0
Revenue      637.0
dtype: float64

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [62]:
dif_price = df_products[["UnitPrice"]].max() - df_products[["UnitPrice"]].min()
dif_price

UnitPrice    11.77
dtype: float64

## Let's load another dataset for more exercisesº

In [4]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [5]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [6]:
admissions.isnull().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [7]:
admissions.set_index("Serial No.",drop = False , inplace = True)

# drop = False evita que elimine la columna que va a pasar a ser un indice.

In [8]:
admissions.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

In [9]:
admissions.sample(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
366,366,322,104,3,3.5,4.0,8.84,1,0.78
278,278,307,105,2,2.5,3.0,7.65,0,0.58
213,213,308,109,2,3.0,4.0,8.45,0,0.71
66,66,328,115,4,4.5,4.0,9.16,1,0.78
36,36,307,108,2,4.0,3.5,7.70,0,0.48
123,123,319,112,3,2.5,2.0,8.71,1,0.78
196,196,295,99,2,2.5,3.0,7.65,0,0.57
89,89,301,97,2,3.0,3.0,7.88,1,0.44
21,21,334,119,5,5.0,4.5,9.70,1,0.95
331,331,316,98,1,1.5,2.0,7.43,0,0.49

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [11]:
print(len(admissions))
print(len(admissions["GRE Score"].unique()))
print(len(admissions["CGPA"].unique()))

# Comparación tradicional
print(len(admissions) == len(admissions["GRE Score"].unique()) == len(admissions["CGPA"].unique()))

# Nueva funcion
admissions.nunique()
# Es falso que las columnas "GRE Score" y "CGPA" son valores unicos

385
49
168
False

Serial No.           385
GRE Score             49
TOEFL Score           29
University Rating      5
SOP                    9
LOR                    9
CGPA                 168
Research               2
Chance of Admit       60
dtype: int64

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [129]:
((admissions["CGPA"] > 9) & (admissions["Research"] == 1)).sum()

101

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [131]:
((admissions["CGPA"] > 9) & (admissions["SOP"] < 3.5)).mean()

0.012987012987012988

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [134]:
# Forma 1:

admissions["teofl_bool"] = admissions["TOEFL Score"] > 100

In [139]:
admissions.sample(5)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,teofl_bool
Serial No.,,,,,,,,,,
178,178,327,113,4,4.5,4.5,9.11,1,0.89,True
316,316,297,96,2,2.5,1.5,7.89,0,0.43,False
80,80,322,115,5,4.0,4.5,9.36,1,0.92,True
146,146,321,112,5,5.0,5.0,9.06,1,0.86,True
237,237,324,110,3,3.5,4.0,8.87,1,0.80,True

In [144]:
# Forma 2 (La que nos piden)

def toefl(toefl_score):
    if toefl_score > 100:
        return True
    else:
        return False

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [155]:
admissions["Decision"] = admissions["TOEFL Score"].apply(toefl)

In [156]:
admissions.sample(5)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,teofl_bool,Decision
Serial No.,,,,,,,,,,,
114,114,296,99,2,3.0,3.5,7.28,0,0.47,False,False
356,356,310,103,2,2.5,2.5,8.24,0,0.72,True,True
9,9,323,108,3,3.5,3.0,8.60,0,0.45,True,True
52,52,320,103,3,3.0,3.0,7.70,0,0.64,True,True
78,78,340,120,4,5.0,5.0,9.50,1,0.96,True,True

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [173]:
admissions["decision2"] = np.where(admissions["SOP"] > 3, 1, 0)

In [174]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,teofl_bool,Decision,decision2
Serial No.,,,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True,True,1
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True,True,0
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True,True,1
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True,True,0
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True,True,1